import React, {Component} from 'react';
import Image_3 from "../image/img_3.png"
import '../style/style.scss';

class SideTrg extends Component {
    render() {
        return (
            <div>
                <div className="breadcrumbs d-f">
                    <h4 className="background-1">Главная/Пациенты/Все пациенты/Иванов Иван Иванович/Боковая ТРГ</h4>
                </div>
                <div className="SideTrg">
                    <h1 className="color-1 uppercase">боковая трг</h1>
                    <div className="jc-sb">
                        <div className="left">
                            <div className="top jc-sb text-center">
                                <div className="box">
                                    <h5 className="color-2">Ивертировать
                                        цвет</h5>
                                    <div className="jc-sb">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M9.14377 15.6858L8.21957 16.0677L9.14377 15.6858ZM8.91839 15.2337L8.12816 15.8465L8.91839 15.2337ZM15.0816 15.2337L15.8718 15.8465L15.0816 15.2337ZM17 10C17 11.6366 16.2147 13.0895 14.9962 14.0033L16.1961 15.6034C17.8966 14.3282 19 12.2928 19 10H17ZM12 5C14.7614 5 17 7.23858 17 10H19C19 6.13401 15.866 3 12 3V5ZM7 10C7 7.23858 9.23858 5 12 5V3C8.13401 3 5 6.13401 5 10H7ZM9.0038 14.0033C7.78526 13.0895 7 11.6366 7 10H5C5 12.2928 6.1034 14.3282 7.80393 15.6034L9.0038 14.0033ZM10.9973 19.743C10.9654 18.2148 10.6489 16.7097 10.068 15.3039L8.21957 16.0677C8.70598 17.2449 8.97101 18.5051 8.99775 19.7848L10.9973 19.743ZM13.3416 19.2111C12.4971 19.6334 11.5029 19.6334 10.6584 19.2111L9.76393 21C11.1716 21.7038 12.8284 21.7038 14.2361 21L13.3416 19.2111ZM13.932 15.3039C13.3511 16.7097 13.0346 18.2148 13.0027 19.743L15.0022 19.7848C15.029 18.5051 15.294 17.2449 15.7804 16.0677L13.932 15.3039ZM14.2361 21C14.708 20.764 14.9917 20.2888 15.0022 19.7848L13.0027 19.743C13.0072 19.5284 13.1285 19.3177 13.3416 19.2111L14.2361 21ZM8.99775 19.7848C9.00828 20.2888 9.29199 20.764 9.76393 21L10.6584 19.2111C10.8715 19.3177 10.9928 19.5284 10.9973 19.743L8.99775 19.7848ZM7.80393 15.6034C7.95483 15.7165 8.04298 15.7829 8.10525 15.8338C8.16783 15.885 8.15598 15.8824 8.12816 15.8465L9.70862 14.6209C9.52146 14.3795 9.23067 14.1734 9.0038 14.0033L7.80393 15.6034ZM10.068 15.3039C9.98964 15.1144 9.89131 14.8565 9.70862 14.6209L8.12816 15.8465C8.11465 15.8291 8.11215 15.8197 8.12521 15.8469C8.13306 15.8632 8.14391 15.8872 8.1602 15.9253C8.17665 15.9639 8.19514 16.0086 8.21957 16.0677L10.068 15.3039ZM14.9962 14.0033C14.7693 14.1734 14.4785 14.3795 14.2914 14.6209L15.8718 15.8465C15.844 15.8824 15.8322 15.885 15.8948 15.8338C15.957 15.7829 16.0452 15.7165 16.1961 15.6034L14.9962 14.0033ZM15.7804 16.0677C15.8049 16.0086 15.8233 15.9639 15.8398 15.9253C15.8561 15.8872 15.8669 15.8632 15.8748 15.8469C15.8879 15.8197 15.8853 15.8291 15.8718 15.8465L14.2914 14.6209C14.1087 14.8565 14.0104 15.1144 13.932 15.3039L15.7804 16.0677Z" fill="#333333"/>
                                            <path d="M14.992 16V16C13.181 17.2106 10.8189 17.2106 9.00781 16V16" stroke="#333333" stroke-width="2"/>
                                        </svg>
                                        <svg className="svg2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="12" cy="9" r="7" fill="#333333"/>
                                            <path d="M11 14V9.75C11 9.05964 10.4404 8.5 9.75 8.5V8.5C9.05964 8.5 8.5 9.05964 8.5 9.75V9.75C8.5 10.4404 9.05964 11 9.75 11H14.25C14.9404 11 15.5 10.4404 15.5 9.75V9.75C15.5 9.05964 14.9404 8.5 14.25 8.5V8.5C13.5596 8.5 13 9.05964 13 9.75V14" stroke="#333333" stroke-linecap="round"/>
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M15 16.5637C15 16.4535 14.885 16.3807 14.784 16.4246C13.9307 16.7948 12.9893 17 12 17C11.0107 17 10.0693 16.7948 9.21605 16.4246C9.11496 16.3807 9 16.4535 9 16.5637V18.5C9 19.8808 10.1193 21 11.5 21H12.5C13.8807 21 15 19.8808 15 18.5V16.5637Z" fill="#333333"/>
                                        </svg>

                                    </div>

                                </div>
                                <div className="box">
                                    <h5 className="color-2">Свет</h5>
                                    <div className="jc-sb">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="12" cy="12" r="9" stroke="#333333" stroke-width="2"/>
                                            <path d="M18.364 5.63604C16.6761 3.94821 14.3869 3 12 3C9.61305 3 7.32387 3.94821 5.63604 5.63604C3.94821 7.32387 3 9.61305 3 12C3 14.3869 3.94821 16.6761 5.63604 18.364L12 12L18.364 5.63604Z" fill="#333333"/>
                                        </svg>

                                    </div>

                                </div>
                                <div className="box">
                                    <h5 className="color-2">Вращать</h5>
                                    <div className="jc-sb">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M14 15L10 19L14 23" stroke="#333333" stroke-width="2"/>
                                            <path d="M5.93782 15.5C5.16735 14.1655 4.85875 12.6141 5.05989 11.0863C5.26102 9.55856 5.96064 8.13986 7.05025 7.05025C8.13986 5.96064 9.55856 5.26102 11.0863 5.05989C12.6141 4.85875 14.1655 5.16735 15.5 5.93782C16.8345 6.70829 17.8775 7.89757 18.4672 9.32122C19.0568 10.7449 19.1603 12.3233 18.7615 13.8117C18.3627 15.3002 17.4838 16.6154 16.2613 17.5535C15.0388 18.4915 13.5409 19 12 19" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                        </svg>
                                        <svg  className="svg2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M10 9L14 5L10 1" stroke="#333333" stroke-width="2"/>
                                            <path d="M18.0622 8.5C18.8326 9.83449 19.1412 11.3859 18.9401 12.9137C18.739 14.4414 18.0394 15.8601 16.9497 16.9497C15.8601 18.0394 14.4414 18.739 12.9137 18.9401C11.3859 19.1412 9.83449 18.8326 8.5 18.0622C7.16551 17.2917 6.12254 16.1024 5.53284 14.6788C4.94315 13.2551 4.83969 11.6767 5.23852 10.1883C5.63734 8.69983 6.51616 7.38459 7.73867 6.44653C8.96118 5.50846 10.4591 5 12 5" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                        </svg>


                                    </div>

                                </div>
                                <div className="box">
                                    <h5 className="color-2">Масштаб</h5>
                                    <div className="jc-sb">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd" d="M12 21C16.9706 21 21 16.9706 21 12C21 7.02944 16.9706 3 12 3C7.02944 3 3 7.02944 3 12C3 16.9706 7.02944 21 12 21ZM7 13H17V11H7V13Z" fill="#333333"/>
                                        </svg>
                                        <svg  className="svg2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="12" cy="12" r="9" stroke="#333333" stroke-width="2"/>
                                            <path d="M12 15L12 9" stroke="#333333" stroke-width="2" stroke-linecap="square"/>
                                            <path d="M15 12L9 12" stroke="#333333" stroke-width="2" stroke-linecap="square"/>
                                        </svg>

                                    </div>

                                </div>
                                <div className="box">
                                    <h5 className="color-2">Убрать точки</h5>
                                    <div className="jc-sb">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="12" cy="12" r="7" fill="black" stroke="#333333" stroke-width="2"/>
                                            <path d="M7.0502 7.0502L4 4.00024M16.9497 7.0502L20 4.00024M20 20.0002L16.9497 16.9497M4 20.0002L7.0502 16.9497" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                        </svg>
                                        <svg  className="svg2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <circle cx="12" cy="12" r="7" stroke="#333333" stroke-width="2"/>
                                            <circle cx="12" cy="12" r="2" fill="#333333" stroke="#333333" stroke-width="2"/>
                                            <path d="M7.0502 7.0502L4 4.00024M16.9497 7.0502L20 4.00024M20 20.0002L16.9497 16.9497M4 20.0002L7.0502 16.9497" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                        </svg>

                                    </div>

                                </div>
                                <div className="box">
                                    <h5 className="color-2">Убрать линии</h5>
                                    <div className="jc-sb">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <ellipse cx="7" cy="8" rx="3" ry="3" transform="rotate(90 7 8)" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                            <ellipse cx="17" cy="16" rx="3" ry="3" transform="rotate(90 17 16)" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                        </svg>
                                        <svg  className="svg2" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M11 8L20 8" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                            <path d="M4 16L14 16" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                            <ellipse cx="7" cy="8" rx="3" ry="3" transform="rotate(90 7 8)" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                            <ellipse cx="17" cy="16" rx="3" ry="3" transform="rotate(90 17 16)" stroke="#333333" stroke-width="2" stroke-linecap="round"/>
                                        </svg>

                                    </div>

                                </div>

                            </div>
                            <div className="bottom mt100">
                                <img src={Image_3} alt=""/>
                            </div>
                        </div>
                        <div className="right">
                            <p className="color-2">
                            S - Точка в середине турецкого седла. Геометрический центр гипофиза.

                            </p>
                            <p className="color-2">
                            Se - Средняя точка на середине входа в турецкое седло

                            </p>
                            <p className="color-2">
                            N – передне верхний край носолобного шва

                            </p>
                            <p className="color-2">
                            A - наиболее углубленная, расположена на переднем контуре апикального базиса верхней челюсти

                            </p>
                            <p className="color-2">
                            B - наиболее углубленная, расположена на переднем контуре апикального базиса нижней челюсти

                            </p>
                            <p className="color-2">
                            is – режущий край центрального верхнего резца

                            </p>
                            <p className="color-2">
                            ais - Точка, соответствующая верхушке корня центральных резцов верхней челюсти

                            </p>
                            <p className="color-2">
                            U1 – линия через is-ais

                            </p>
                            <p className="color-2">
                            U1’ — проекция точки U1 на плоскость NL (ставится автоматически)

                            </p>
                            <p className="color-2">
                            ii- режущий край центрального нижнего резца

                            </p>
                            <p className="color-2">
                            aii - Точка, соответствующая верхушке корня центральных резцов нижней челюсти

                            </p>
                            <p className="color-2">
                            L1 – линия через ii-aii

                            </p>
                            <p className="color-2">
                            L1’ – проекция точки L1 на плоскость ML (ставится автоматически)

                            </p>
                            <p className="color-2">
                            U6 – дистальная точка первого верхнего моляра

                            </p>
                            <p className="color-2">
                            U6’-проекция точки U6 на плоскость NL (ставится автоматически)

                            </p>
                            <p className="color-2">
                            L6 - дистальная точка первого нижнего моляра

                            </p>
                            <p className="color-2">
                            L6’ проекция точки L6 на плоскость ML (ставится автоматически)

                            </p>
                            <p className="color-2">
                            Pt - Дистальная верхняя точка крыловидной фиссуры

                            </p>
                            <p className="color-2">
                            Po (Pr)– верхняя точка наружного слухового прохода

                            </p>
                            <p className="color-2">
                            Or -середина нижнеглазничного края

                            </p>
                            <p className="color-2">
                            Sna – передняя носовая ость

                            </p>
                            <p className="color-2">
                            Snp задняя носовая ость

                            </p>
                            <p className="color-2">
                            Go- нижняя точка угла нижней челюсти (между касательными к телу и ветви НЧ)

                            </p>
                            <p className="color-2">
                            Me - Нижняя точка на нижнем контуре тела нижней челюсти в месте наложения симфиза

                            </p>
                            <p className="color-2">
                            Ba - Наиболее нижняя точка на передней поверхности большого затылочного отверстия

                            </p>
                            <p className="color-2">
                            Ar - Точка на заднем контуре головки нижней челюсти в месте пересечения ее с кливусом

                            </p>
                            <p className="color-2">
                            A1 - Проекция точки А на плоскость основания верхней челюсти NL

                            </p>
                            <p className="color-2">
                            Pg - Наиболее выступающая точка подбородка

                            </p>
                            <p className="color-2">
                            Pg’ – Проекция точки Pg (перпендикуляр из Pg) на плоскость MT1-MT2 (ставится автоматически)

                            </p>
                            <p className="color-2">
                            Co - Дистальная точка головки нижней челюсти

                            </p>
                            <p className="color-2">
                            mm-дистальный бугор второго моляра

                            </p>
                            <p className="color-2">
                            A1-Проекция точки А на плоскость основания верхней челюсти (NL)

                            </p>
                        </div>
                    </div>
                </div>
                <div className="box1">
                    <svg viewBox="0 0 76 84" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M33.0864 1.77206C36.1362 0.051484 39.8638 0.0514803 42.9136 1.77205L56.7265 9.56475L70.3816 17.6307C73.3966 19.4116 75.2604 22.6398 75.2952 26.1413L75.453 42L75.2952 57.8587C75.2604 61.3602 73.3966 64.5884 70.3816 66.3693L56.7265 74.4352L42.9136 82.2279C39.8638 83.9485 36.1362 83.9485 33.0864 82.2279L19.2735 74.4352L5.61838 66.3693C2.60342 64.5884 0.739617 61.3602 0.70478 57.8587L0.547001 42L0.70478 26.1413C0.739617 22.6398 2.60341 19.4116 5.61837 17.6307L19.2735 9.56475L33.0864 1.77206Z" fill="#F8F8F8"/>
                    </svg>
                </div>
                <div className="box2">
                    <svg viewBox="0 0 410 550" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M236.086 1.77205C239.136 0.0514783 242.864 0.0514808 245.914 1.77206L361.198 66.811L475.166 134.131C478.181 135.912 480.044 139.14 480.079 142.641L481.396 275L480.079 407.359C480.044 410.86 478.181 414.088 475.166 415.869L361.198 483.189L245.914 548.228C242.864 549.949 239.136 549.949 236.086 548.228L120.802 483.189L6.83445 415.869C3.81949 414.088 1.9557 410.86 1.92086 407.359L0.604004 275L1.92086 142.641C1.9557 139.14 3.8195 135.912 6.83446 134.131L120.802 66.811L236.086 1.77205Z" fill="#F8F8F8"/>
                    </svg>
                </div>
            </div>
        );
    }
}


export default SideTrg;